multi="полусухая стяжка пола цена +за метр;ПОЛУСУХАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
полусухая стяжка пола московская область;ПОЛУСУХАЯ СТЯЖКА ПОЛА В МОСКОВСКОЙ ОБЛАСТИ ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
полусухая стяжка пола цена;ПОЛУСУХАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
заказать полусухую стяжку пола;ПОЛУСУХАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
полусухая стяжка пола с фиброволокном;ПОЛУСУХАЯ СТЯЖКА ПОЛА С ФИБРОВОЛОКНОМ ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
влажная стяжка пола;ВЛАЖНАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
стоимость метра стяжки пола;СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
полусухая стяжка пола гарантией;ПОЛУСУХАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
полусухая стяжка пола;ПОЛУСУХАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
стоимость метра стяжки пола;СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
полусухая стяжка пола цена;ПОЛУСУХАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
баня стяжка пола;СТЯЖКА ПОЛА ДЛЯ БАНИ ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
быстросохнущая стяжка пола;БЫСТРОСОХНУЩАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
влажная стяжка пола;ВЛАЖНАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
водяной пол стяжка;СТЯЖКА ДЛЯ ВОДЯНОГО ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
водяные полы стяжка цена;СТЯЖКА ДЛЯ ВОДЯНОГО ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
выравнивание деревянного пола стяжкой;ВЫРАВНИМ ДЕРЕВЯННЫЙ ПОЛ СТЯЖКОЙ ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
выравнивание пола стяжкой;ВЫРАВНИМ ПОЛ СТЯЖКОЙ ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
выравнивающая стяжка пола;ВЫРАВНИМ ПОЛ СТЯЖКОЙ ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
делать стяжку теплого пола;СТЯЖКА ДЛЯ ТЕПЛОГО ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
заказать стяжку пола +в квартире;СТЯЖКА ПОЛА ДЛЯ КВАРТИРЫ ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
заказать стяжку пола;СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
заливка полусухой стяжки пола;ЗАЛИВКА ПОЛУСУХОЙ СТЯЖКИ ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
заливка стяжки пола;ЗАЛИВКА СТЯЖКИ ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
заливка стяжки пола цена;ЗАЛИВКА СТЯЖКИ ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
легкая стяжка пола;ЛЕГКАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
механизированная полусухая стяжка пола;МЕХАНИЗИРОВАННАЯ ПОЛУСУХАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
механизированная стяжка пола цена +за м2;МЕХАНИЗИРОВАННАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
механическая стяжка пола цена;МЕХАНИЗИРОВАННАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
монолитная стяжка пола;МОНОЛИТНАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
монтаж стяжки пола;МОНТАЖ СТЯЖКИ ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
песчаная стяжка пола;ПЕСЧАНАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
плавающая стяжка пола;ПЛАВАЮЩАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
полусухая машинная стяжка пола;ПОЛУСУХАЯ МАШИННАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
полусухая стяжка пола +в москве;ПОЛУСУХАЯ МАШИННАЯ СТЯЖКА ПОЛА В МОСКВЕ ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
полусухая стяжка пола;ПОЛУСУХАЯ  СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
полусухая стяжка пола недорого;ПОЛУСУХАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
полусухая стяжка пола с фиброволокном;ПОЛУСУХАЯ СТЯЖКА ПОЛА С ФИБРОВОЛОКНОМ ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
полусухая стяжка пола фиброволокном цена;ПОЛУСУХАЯ СТЯЖКА ПОЛА С ФИБРОВОЛОКНОМ ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
полусухая стяжка пола цена +за метр;ПОЛУСУХАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
полусухая стяжка пола цена;ПОЛУСУХАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
полусухая стяжка пола цена с материалом;ПОЛУСУХАЯ СТЯЖКА ПОЛА ПОД КЛЮЧ С МАТЕРИАЛАМИ  ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
полусухая стяжка пола цены москве;ПОЛУСУХАЯ СТЯЖКА ПОЛА В МОСКВЕ ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
полусухая стяжка пола шумоизоляцией;ПОЛУСУХАЯ СТЯЖКА ПОЛА С ШУМОИЗОЛЯЦИЕЙ  ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
простая стяжка пола;ПОЛУСУХАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
расценки +на стяжку пола +по маякам;СТЯЖКА ПОЛА ПО МАЯКАМ ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
расценки устройство стяжки пола;ПОЛУСУХАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
ручная стяжка пола;РУЧНАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
сделать стяжку пола +в новостройке;СТЯЖКА ПОЛА В НОВОСТРОЙКЕ ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
сделать стяжку пола +под ламинат;СТЯЖКА ПОЛА ПОД ЛАМИНАТ ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
сделать стяжку пола цена;СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
сколько стоит 1 м2 стяжки пола;СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
сколько стоит полусухая стяжка пола;ПОЛУСУХАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
сколько стоит полусухая стяжка пола с материалом;ПОЛУСУХАЯ СТЯЖКА ПОЛА ПОД КЛЮЧ С МАТЕРИАЛОМИ ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
сколько стоит сделать стяжку пола;СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
сколько стоит сделать стяжку пола +в квартире;СТЯЖКА ПОЛА В КВАРТИРЕ ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
сколько стоит стяжка пола;СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
сколько стоит стяжка пола цена +за м2;СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
стоимость заливки стяжки пола цена;СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
стоимость метра стяжки пола;СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
авито стяжка пола;ПОЛУСУХАЯ СТЯЖКА ПОЛА ЗА 24 ЧАСА ПО НЕМЕЦКОЙ ТЕХНОЛОГИИ С ГАРАНТИЕЙ 5 ЛЕТ;\n\
";

$(function() {
  //формируем массив с utm метками
  function getURLParameter(name) {
    return decodeURIComponent((new RegExp('[?|&]' + name + '=' + '([^&;]+?)(&|#|;|$)').exec(location.search)||[,""])[1].replace(/\+/g, '%20'))||null;
  }

  utm=[];
  $.each(["utm_source","utm_medium","utm_campaign","utm_term",'source_type','source','position_type','position','added','creative','matchtype'],function(i,v){
    utm[v]=getURLParameter(v) || $.cookie(v);
    $.cookie(v, utm[v], { expires: 365, path: '/' });
  });

  // MULTI
  var ab_title = "default";
  if(utm['utm_term']){
    multi=multi.split('\n');
    multi=$.map(multi,function(v, i){
      arr1=v.split(';');
      r=new RegExp(arr1[0]);
      return {reg: r,val: arr1[1]};
    });
    multi=$.grep(multi,function(v,i){
      return utm['utm_term'].search(v.reg) > -1
    });
    if(multi[0]){
      ab_title=multi[0].val;
      var target = $('.multi'); //элемент для подмены
      target.html(ab_title); 
    }
  }
});
